## 5. Data 분석용 함수
### 1) 외부 데이터 읽고 쓰기

### 2) 통계적 함수들

### 3) Sorting

### 4)  기타 함수

### Quiz 다음 데이터 프레임에서 지정하는 데이터를 추출하거나 처리해라.

In [3]:
import pandas as pd

In [5]:
data={'Math':[80,70,100,30],
     'Science':[100,80,90,50],
     'English':[70,100,80,70]}
columns = ['Math','Science','English']
index=['Amy','Tom','Michael','Clara']
df=pd.DataFrame(data,index=index,columns=columns)


1. 모든 학생의 수학 점수를 Series로 나타내라.

In [6]:
pd.Series(data['Math'])

0     80
1     70
2    100
3     30
dtype: int64

In [7]:
df['Math']

Amy         80
Tom         70
Michael    100
Clara       30
Name: Math, dtype: int64

In [8]:
df.Math

Amy         80
Tom         70
Michael    100
Clara       30
Name: Math, dtype: int64

2. 모든 학생의 과학과 영어 점수를 DataFrame으로 나타내라.

In [9]:
df[['Science','English']]

         Science  English
Amy          100       70
Tom           80      100
Michael       90       80
Clara         50       70

3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가해라.

In [12]:
df['Mean'] = df.mean(axis=1)
df

         Math  Science  English       Mean
Amy        80      100       70  83.333333
Tom        70       80      100  83.333333
Michael   100       90       80  90.000000
Clara      30       50       70  50.000000

4. Tom의 영어 점수를 90점으로 수정하고 평균 점수를 다시 계산해라.

In [16]:
df.loc['Tom','English']=90
df

         Math  Science  English       Mean
Amy        80      100       70  83.333333
Tom        70       80       90  83.333333
Michael   100       90       80  90.000000
Clara      30       50       70  50.000000

In [18]:
df['Mean'] = df.mean(axis=1)
df

         Math  Science  English       Mean
Amy        80      100       70  83.333333
Tom        70       80       90  80.208333
Michael   100       90       80  90.000000
Clara      30       50       70  50.000000

5. 각 학생에 대하여 수학 점수가 80점 이상인 학생은 Pass, 그렇지 못한 학생은 Fail로 표시하는 Result column을 추가해라.

In [24]:
func = lambda x:'Path' if x>80 else 'Fail'

In [27]:
df['Score']=df['Math'].apply(func)
df

         Math  Science  English       Mean Score
Amy        80      100       70  83.333333  Fail
Tom        70       80       90  80.208333  Fail
Michael   100       90       80  90.000000  Path
Clara      30       50       70  50.000000  Fail

6. 평균 점수가 높은 순서대로 DataFrame을 정렬하여라.

In [29]:
sorted_df= df.sort_values(by='Mean',ascending=False)
sorted_df

         Math  Science  English       Mean Score
Michael   100       90       80  90.000000  Path
Amy        80      100       70  83.333333  Fail
Tom        70       80       90  80.208333  Fail
Clara      30       50       70  50.000000  Fail